DataProcessors/LN_МСРИнструментЗапросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>LN_МСРИнструментЗапросы</Name>
			<Comment>Контейнер tools: execute_query, execute_code, validate_query</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/LN_МСРКэшВыборок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>LN_МСРКэшВыборок</Name>
			<Comment>Серверный буфер табличных результатов execute_query для постраничной выдачи по cursor. TTL по умолчанию 300 секунд (query_cursor_ttl_seconds).</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВыборки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияСек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/LN_МСРНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>LN_МСРНастройки</Name>
			<Comment>Серверные настройки LN_MCP_1C (формат ответа, лимиты токенов, режим execute_code, и т.п.)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/LN_МСРИнструментЗапросы/Ext/ManagerModule.bsl
//LN++ ManagerModule обработки LN_МСРИнструментЗапросы
// Tools (через подсистему mcp_КонтейнерыИнструментов):
//   - execute_query    — выполнить произвольный запрос 1С (с авто-конвертацией ISO-8601 параметров и опц. схемой);
//                        поддержка page_size + cursor (real cursor через РегистрСведений.LN_МСРКэшВыборок)
//   - execute_code     — выполнить произвольный код BSL. По умолчанию ПОЛНОЦЕННЫЙ режим.
//                        Безопасный режим включается только явным safe_mode=true ИЛИ настройкой
//                        execute_code_default_safe в РегистрСведений.LN_МСРНастройки.
//   - execute_dcs      — выполнить отчёт СКД (схема — XML/макет/файл), вернуть таблицу
//   - validate_query   — проверить синтаксис запроса без выполнения (full | fast)
//
// Конвенция приведения значений — LN_МСРКодирование.БезопасноеЗначение(...) (рекурсивная).

Процедура ДобавитьИнструменты(Инструменты) Экспорт

	ДобавитьExecuteQuery(Инструменты);
	ДобавитьExecuteCode(Инструменты);
	ДобавитьExecuteDcs(Инструменты);
	ДобавитьValidateQuery(Инструменты);

КонецПроцедуры

Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы) Экспорт

	Если ИмяИнструмента = "execute_query" Тогда
		Возврат ВыполнитьЗапрос(Аргументы);
	ИначеЕсли ИмяИнструмента = "execute_code" Тогда
		Возврат ВыполнитьКод(Аргументы);
	ИначеЕсли ИмяИнструмента = "execute_dcs" Тогда
		Возврат ВыполнитьСКД(Аргументы);
	ИначеЕсли ИмяИнструмента = "validate_query" Тогда
		Возврат ВалидироватьЗапрос(Аргументы);
	Иначе
		ВызватьИсключение "Неизвестный инструмент: " + ИмяИнструмента;
	КонецЕсли;

КонецФункции

#Область execute_dcs

Процедура ДобавитьExecuteDcs(Инструменты)

	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"schema_source", "string",
		"Откуда взять схему СКД: ""xml"" (передаётся в schema_xml), ""template"" (макет МД из template_address), ""path"" (файл на диске из path).",
		"xml", Истина, "xml,template,path"));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"schema_xml", "string",
		"XML-тело СхемыКомпоновкиДанных. Используется при schema_source=xml.", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"template_address", "string",
		"Полный адрес макета МД (например ""Отчет.АнализПродаж.МакетСхема""). Используется при schema_source=template.", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"path", "string",
		"Путь к XML-файлу схемы СКД на диске. Используется при schema_source=path.", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"parameters", "object",
		"Параметры отчёта (имя→значение). Поддержка ISO-8601 дат и {type,uuid} ссылок аналогично execute_query.",
		Новый Структура, Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"settings_variant", "string",
		"Имя пользовательской вариантной настройки СКД (если есть). По умолчанию — настройки по умолчанию.", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"limit", "number", "Лимит строк результата (по умолчанию 100, максимум 10000)", 100));

	mcp_Метаданные.ДобавитьИнструмент(Инструменты, "execute_dcs",
		"Выполняет отчёт СКД и возвращает результат таблицей. Схема берётся из XML-строки,"
			+ " макета МД или файла на диске. Применяются параметры компоновщика, опционально — вариант настроек.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Функция ВыполнитьСКД(Аргументы)

	ИсточникСхемы = НРег(?(Аргументы.Свойство("schema_source"), СокрЛП(Строка(Аргументы.schema_source)), "xml"));
	Если ИсточникСхемы = "" Тогда ИсточникСхемы = "xml"; КонецЕсли;
	Схема = ПолучитьСхемуСКД(ИсточникСхемы, Аргументы);

	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема);
	Компоновщик.Инициализировать(ИсточникДоступныхНастроек);
	НастройкиВыбраны = Ложь;
	ИмяВарианта = ?(Аргументы.Свойство("settings_variant"), СокрЛП(Строка(Аргументы.settings_variant)), "");
	Если ЗначениеЗаполнено(ИмяВарианта) И Схема.ВариантыНастроекПоУмолчанию.Найти(ИмяВарианта) <> Неопределено Тогда
		Компоновщик.ЗагрузитьНастройки(Схема.ВариантыНастроекПоУмолчанию[ИмяВарианта].Настройки);
		НастройкиВыбраны = Истина;
	КонецЕсли;
	Если Не НастройкиВыбраны Тогда
		Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;

	// Параметры компоновщика
	Если Аргументы.Свойство("parameters") И ТипЗнч(Аргументы.parameters) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из Аргументы.parameters Цикл
			ПодготовленноеЗначение = КонвертироватьЗначениеПараметра(КлючЗначение.Значение);
			Параметр = Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(КлючЗначение.Ключ));
			Если Параметр <> Неопределено Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = ПодготовленноеЗначение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Компоновщик.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанных"));
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(МакетКомпоновки);
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ВыводТаблицы = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ВыводТаблицы.УстановитьОбъект(ТаблицаЗначений);
	ВыводТаблицы.Вывести(Процессор);

	Предел = ?(Аргументы.Свойство("limit"), Число(Аргументы.limit), 100);
	Если Предел <= 0 Тогда Предел = 100; КонецЕсли;
	Если Предел > 10000 Тогда Предел = 10000; КонецЕсли;
	Усечено = Ложь;
	Если ТаблицаЗначений.Количество() > Предел Тогда
		Пока ТаблицаЗначений.Количество() > Предел Цикл
			ТаблицаЗначений.Удалить(ТаблицаЗначений.Количество() - 1);
		КонецЦикла;
		Усечено = Истина;
	КонецЕсли;

	Колонки = Новый Массив;
	Строки = Новый Массив;
	Для Каждого Кол Из ТаблицаЗначений.Колонки Цикл Колонки.Добавить(Кол.Имя); КонецЦикла;
	Для Каждого Стр Из ТаблицаЗначений Цикл
		РСтр = Новый Структура;
		Для Каждого ИмяКолонки Из Колонки Цикл
			РСтр.Вставить(ИмяКолонки, LN_МСРКодирование.БезопасноеЗначение(Стр[ИмяКолонки]));
		КонецЦикла;
		Строки.Добавить(РСтр);
	КонецЦикла;
	Возврат Новый Структура("columns, rows, row_count, truncated, schema_source",
		Колонки, Строки, Строки.Количество(), Усечено, ИсточникСхемы);

КонецФункции

Функция ПолучитьСхемуСКД(ИсточникСхемы, Аргументы)
	Если ИсточникСхемы = "xml" Тогда
		Тело = ?(Аргументы.Свойство("schema_xml"), Строка(Аргументы.schema_xml), "");
		Если Не ЗначениеЗаполнено(Тело) Тогда
			ВызватьИсключение "schema_source=xml требует schema_xml";
		КонецЕсли;
		Возврат СхемаИзСтрокиXML(Тело);
	ИначеЕсли ИсточникСхемы = "template" Тогда
		Адрес = ?(Аргументы.Свойство("template_address"), СокрЛП(Строка(Аргументы.template_address)), "");
		Если Не ЗначениеЗаполнено(Адрес) Тогда
			ВызватьИсключение "schema_source=template требует template_address";
		КонецЕсли;
		Части = СтрРазделить(Адрес, ".", Ложь);
		Если Части.Количество() < 3 Тогда
			ВызватьИсключение "template_address должен быть в формате <Тип>.<Имя>.<Макет>";
		КонецЕсли;
		МД = Метаданные.НайтиПоПолномуИмени(Части[0] + "." + Части[1]);
		Если МД = Неопределено Тогда
			ВызватьИсключение СтрШаблон("Объект %1.%2 не найден", Части[0], Части[1]);
		КонецЕсли;
		Менеджер = МенеджерПоПолномуИмени(Части[0], Части[1]);
		Возврат Менеджер.ПолучитьМакет(Части[2]);
	ИначеЕсли ИсточникСхемы = "path" Тогда
		Путь = ?(Аргументы.Свойство("path"), СокрЛП(Строка(Аргументы.path)), "");
		Если Не ЗначениеЗаполнено(Путь) Тогда
			ВызватьИсключение "schema_source=path требует path";
		КонецЕсли;
		Если Не НайтиФайлы(Путь).Количество() Тогда
			ВызватьИсключение СтрШаблон("Файл схемы не найден: %1", Путь);
		КонецЕсли;
		Чтение = Новый ЧтениеТекста(Путь, КодировкаТекста.UTF8);
		Возврат СхемаИзСтрокиXML(Чтение.Прочитать());
	Иначе
		ВызватьИсключение СтрШаблон("Неподдерживаемый schema_source: %1", ИсточникСхемы);
	КонецЕсли;
КонецФункции

Функция СхемаИзСтрокиXML(ТекстXML)
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ТекстXML);
	Возврат СериализаторXDTO.ПрочитатьXML(Чтение, Тип("СхемаКомпоновкиДанных"));
КонецФункции

Функция МенеджерПоПолномуИмени(Категория, Имя)
	КатегорияНРег = НРег(Категория);
	Если КатегорияНРег = "справочник" Тогда Возврат Справочники[Имя]; КонецЕсли;
	Если КатегорияНРег = "документ" Тогда Возврат Документы[Имя]; КонецЕсли;
	Если КатегорияНРег = "отчет" Тогда Возврат Отчеты[Имя]; КонецЕсли;
	Если КатегорияНРег = "обработка" Тогда Возврат Обработки[Имя]; КонецЕсли;
	Если КатегорияНРег = "регистрсведений" Тогда Возврат РегистрыСведений[Имя]; КонецЕсли;
	Если КатегорияНРег = "регистрнакопления" Тогда Возврат РегистрыНакопления[Имя]; КонецЕсли;
	Если КатегорияНРег = "регистрбухгалтерии" Тогда Возврат РегистрыБухгалтерии[Имя]; КонецЕсли;
	Если КатегорияНРег = "регистррасчета" Тогда Возврат РегистрыРасчета[Имя]; КонецЕсли;
	Если КатегорияНРег = "перечисление" Тогда Возврат Перечисления[Имя]; КонецЕсли;
	Если КатегорияНРег = "бизнеспроцесс" Тогда Возврат БизнесПроцессы[Имя]; КонецЕсли;
	Если КатегорияНРег = "задача" Тогда Возврат Задачи[Имя]; КонецЕсли;
	Если КатегорияНРег = "планвидовхарактеристик" Тогда Возврат ПланыВидовХарактеристик[Имя]; КонецЕсли;
	Если КатегорияНРег = "плансчетов" Тогда Возврат ПланыСчетов[Имя]; КонецЕсли;
	Если КатегорияНРег = "планвидоврасчета" Тогда Возврат ПланыВидовРасчета[Имя]; КонецЕсли;
	Если КатегорияНРег = "планобмена" Тогда Возврат ПланыОбмена[Имя]; КонецЕсли;
	ВызватьИсключение СтрШаблон("Не поддерживается категория объекта: %1", Категория);
КонецФункции

#КонецОбласти

#Область execute_query

Процедура ДобавитьExecuteQuery(Инструменты)

	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"query", "string", "Текст запроса 1С", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"parameters", "object",
		"Параметры запроса (имя→значение). Строки в формате ISO-8601 (yyyy-MM-dd[Thh:mm:ss]) "
			+ "авто-конвертируются в Дату. Структуры вида {type,uuid} — в навигационные ссылки.",
		Новый Структура, Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"limit", "number", "Максимум возвращаемых строк ЗА ОДИН вызов (по умолчанию 100, максимум 10000)", 100));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"include_schema", "boolean",
		"Если true — в ответе вернётся schema = список колонок с типами (имитация СформироватьСхемуРезультата).", Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"page_size", "number",
		"Размер страницы для курсорной пагинации. Если задан и > 0 — полный результат запроса"
			+ " кэшируется в РегистрСведений.LN_МСРКэшВыборок, отдаётся первая страница и next_cursor"
			+ " для последующих вызовов.", 0));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"cursor", "string",
		"Курсор от предыдущего ответа. Если передан — query/parameters игнорируются,"
			+ " отдаётся следующая страница кэшированного результата.", , Ложь));

	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты,
		"execute_query",
		"Выполняет запрос 1С на сервере и возвращает результат как массив строк."
			+ " Поддерживает: именованные параметры, авто-конвертацию ISO-8601 → Дата,"
			+ " {type,uuid} → ссылка, опц. схему колонок, жёсткий лимит, курсорную пагинацию (page_size + cursor).",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Функция ВыполнитьЗапрос(Аргументы)

	Курсор = ?(Аргументы.Свойство("cursor"), СокрЛП(Строка(Аргументы.cursor)), "");
	Если ЗначениеЗаполнено(Курсор) Тогда
		Возврат ОтдатьСтраницуПоКурсору(Курсор);
	КонецЕсли;

	ТекстЗапроса = ?(Аргументы.Свойство("query"), Аргументы.query, "");
	Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ВызватьИсключение "Параметр query обязателен (или укажите cursor)";
	КонецЕсли;
	ПараметрыЗапр = ?(Аргументы.Свойство("parameters"), Аргументы.parameters, Новый Структура);
	ПараметрыЗапр = mcp_ОбщегоНазначения.ПривестиJSONКСтруктуре(ПараметрыЗапр);
	Если ТипЗнч(ПараметрыЗапр) <> Тип("Структура") Тогда
		ПараметрыЗапр = Новый Структура;
	КонецЕсли;
	Лимит = ?(Аргументы.Свойство("limit"), Аргументы.limit, 100);
	Если Лимит <= 0 Тогда Лимит = 100; КонецЕсли;
	Если Лимит > 10000 Тогда Лимит = 10000; КонецЕсли;
	ВключитьСхему = ?(Аргументы.Свойство("include_schema"), Аргументы.include_schema, Ложь);
	РазмерСтраницы = ?(Аргументы.Свойство("page_size"), Число(Аргументы.page_size), 0);
	Если РазмерСтраницы < 0 Тогда РазмерСтраницы = 0; КонецЕсли;
	Если РазмерСтраницы > 10000 Тогда РазмерСтраницы = 10000; КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	Если ТипЗнч(ПараметрыЗапр) = Тип("Структура") ИЛИ ТипЗнч(ПараметрыЗапр) = Тип("Соответствие") Тогда
		Для Каждого КЗ Из ПараметрыЗапр Цикл
			Запрос.УстановитьПараметр(КЗ.Ключ, КонвертироватьЗначениеПараметра(КЗ.Значение));
		КонецЦикла;
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	ИменаКолонок = Новый Массив;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;

	// Режим без курсорной пагинации — старая семантика.
	Если РазмерСтраницы = 0 Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Строки = Новый Массив;
		Счетчик = 0;
		Пока Выборка.Следующий() И Счетчик < Лимит Цикл
			Стр = Новый Структура;
			Для Каждого ИмяКолонки Из ИменаКолонок Цикл
				Стр.Вставить(ИмяКолонки, LN_МСРКодирование.БезопасноеЗначение(Выборка[ИмяКолонки]));
			КонецЦикла;
			Строки.Добавить(Стр);
			Счетчик = Счетчик + 1;
		КонецЦикла;
		Результат = Новый Структура;
		Результат.Вставить("columns", ИменаКолонок);
		Результат.Вставить("rows", Строки);
		Результат.Вставить("row_count", Счетчик);
		Результат.Вставить("truncated", Счетчик >= Лимит);
		Если ВключитьСхему Тогда
			Результат.Вставить("schema", СформироватьСхемуКолонок(РезультатЗапроса));
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;

	// Режим курсорной пагинации — кладём всё в кэш выборок и отдаём первую страницу.
	ВсеСтроки = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = Новый Структура;
		Для Каждого ИмяКолонки Из ИменаКолонок Цикл
			Стр.Вставить(ИмяКолонки, LN_МСРКодирование.БезопасноеЗначение(Выборка[ИмяКолонки]));
		КонецЦикла;
		ВсеСтроки.Добавить(Стр);
	КонецЦикла;

	Идентификатор = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
	TTLСек = Число(LN_МСРКэш.ПолучитьНастройку("query_cursor_ttl_seconds", 300));
	Если TTLСек <= 0 Тогда TTLСек = 300; КонецЕсли;
	ЗапомнитьВыборку(Идентификатор, Новый Структура("columns, rows, page_size", ИменаКолонок, ВсеСтроки, РазмерСтраницы), TTLСек);
	Возврат ОтдатьСтраницуИзМассива(Идентификатор, ВсеСтроки, ИменаКолонок, 0, РазмерСтраницы, ВключитьСхему, РезультатЗапроса);

КонецФункции

Функция ОтдатьСтраницуПоКурсору(Курсор)
	РасшифрованныйКурсор = РасшифроватьКурсор(Курсор);
	Если РасшифрованныйКурсор = Неопределено Тогда
		ВызватьИсключение "Невалидный cursor";
	КонецЕсли;
	Идентификатор = РасшифрованныйКурсор.id;
	Смещение      = Число(РасшифрованныйКурсор.offset);
	Кэшированное = ПрочитатьВыборку(Идентификатор);
	Если Кэшированное = Неопределено Тогда
		ВызватьИсключение "Курсор просрочен или удалён (TTL истёк) — повторите execute_query без cursor";
	КонецЕсли;
	Возврат ОтдатьСтраницуИзМассива(Идентификатор, Кэшированное.rows, Кэшированное.columns,
		Смещение, Кэшированное.page_size, Ложь, Неопределено);
КонецФункции

Функция ОтдатьСтраницуИзМассива(Идентификатор, ВсеСтроки, ИменаКолонок, Смещение, РазмерСтраницы, ВключитьСхему, РезультатЗапроса)
	Всего = ВсеСтроки.Количество();
	КонецЭтогоОкна = МинимумДвух(Смещение + РазмерСтраницы, Всего);
	Страница = Новый Массив;
	Для Индекс = Смещение По КонецЭтогоОкна - 1 Цикл
		Страница.Добавить(ВсеСтроки[Индекс]);
	КонецЦикла;
	ЕстьЕщё = КонецЭтогоОкна < Всего;
	Результат = Новый Структура;
	Результат.Вставить("columns", ИменаКолонок);
	Результат.Вставить("rows", Страница);
	Результат.Вставить("row_count", Страница.Количество());
	Результат.Вставить("total_rows", Всего);
	Результат.Вставить("offset", Смещение);
	Результат.Вставить("page_size", РазмерСтраницы);
	Результат.Вставить("has_more", ЕстьЕщё);
	Если ЕстьЕщё Тогда
		Результат.Вставить("next_cursor", СформироватьКурсор(Идентификатор, КонецЭтогоОкна));
	КонецЕсли;
	Если ВключитьСхему И РезультатЗапроса <> Неопределено Тогда
		Результат.Вставить("schema", СформироватьСхемуКолонок(РезультатЗапроса));
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция МинимумДвух(А, Б)
	Если А < Б Тогда Возврат А; КонецЕсли;
	Возврат Б;
КонецФункции

Функция СформироватьКурсор(Идентификатор, Смещение)
	Структура = Новый Структура("id, offset", Идентификатор, Смещение);
	JSON = LN_МСРКодирование.ЗначениеВJSON(Структура, Истина);
	Возврат Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(JSON, "UTF-8"));
КонецФункции

Функция РасшифроватьКурсор(Курсор)
	Попытка
		Двоичные = Base64Значение(Курсор);
		JSON = ПолучитьСтрокуИзДвоичныхДанных(Двоичные, "UTF-8");
		Структура = mcp_ОбщегоНазначения.JSONВСтруктуру(JSON);
		Если ТипЗнч(Структура) <> Тип("Структура") Тогда Возврат Неопределено; КонецЕсли;
		Если Не Структура.Свойство("id") Или Не Структура.Свойство("offset") Тогда Возврат Неопределено; КонецЕсли;
		Возврат Структура;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Процедура ЗапомнитьВыборку(Идентификатор, Данные, TTLСек)
	НаборЗаписей = РегистрыСведений.LN_МСРКэшВыборок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторВыборки.Установить(Идентификатор);
	Запись = НаборЗаписей.Добавить();
	Запись.ИдентификаторВыборки = Идентификатор;
	Запись.Данные              = Новый ХранилищеЗначения(Данные);
	Запись.ВремяСоздания       = ТекущаяДатаСеанса();
	Запись.СрокДействияСек     = TTLСек;
	НаборЗаписей.Записать();
КонецПроцедуры

Функция ПрочитатьВыборку(Идентификатор)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1 КЭШ.Данные, КЭШ.ВремяСоздания, КЭШ.СрокДействияСек
	|ИЗ РегистрСведений.LN_МСРКэшВыборок КАК КЭШ
	|ГДЕ КЭШ.ИдентификаторВыборки = &Ключ");
	Запрос.УстановитьПараметр("Ключ", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда Возврат Неопределено; КонецЕсли;
	Если ТекущаяДатаСеанса() > (Выборка.ВремяСоздания + Выборка.СрокДействияСек) Тогда
		НаборЗаписей = РегистрыСведений.LN_МСРКэшВыборок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторВыборки.Установить(Идентификатор);
		НаборЗаписей.Записать();
		Возврат Неопределено;
	КонецЕсли;
	Возврат Выборка.Данные.Получить();
КонецФункции

// Преобразует значение параметра запроса:
//  - ISO-8601 строки → Дата
//  - Структуры { type, uuid } → ссылка через ПолучитьСсылкуИзНавигационнойСсылки (через сборку URL)
Функция КонвертироватьЗначениеПараметра(Значение)

	Если LN_МСРКодирование.СтрокаISO8601(Значение) Тогда
		Возврат LN_МСРКодирование.ISO8601ВДату(Значение);
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Структура") И Значение.Свойство("type") И Значение.Свойство("uuid") Тогда
		Попытка
			Возврат LN_МСРКодирование.ПолучитьСсылкуИзНавигационнойСсылки(
				"e1cib/data/" + Значение.type + "?ref=" + СтрЗаменить(Значение.uuid, "-", ""));
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Значение;

КонецФункции

Функция СформироватьСхемуКолонок(РезультатЗапроса)

	Колонки = Новый Массив;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Типы = Новый Массив;
		Для Каждого ТипЭлемент Из Колонка.ТипЗначения.Типы() Цикл
			Типы.Добавить(Строка(ТипЭлемент));
		КонецЦикла;
		Колонки.Добавить(Новый Структура("name, types", Колонка.Имя, Типы));
	КонецЦикла;
	Возврат Колонки;

КонецФункции

#КонецОбласти

#Область execute_code

Процедура ДобавитьExecuteCode(Инструменты)

	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"code", "string", "Текст кода BSL. Должен присваивать значение переменной Результат.", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"safe_mode", "boolean",
		"Безопасный режим (УстановитьБезопасныйРежим + чёрный список ключевых слов). "
			+ "По умолчанию читается из настройки execute_code_default_safe регистра LN_МСРНастройки "
			+ "(если её нет — Ложь = ПОЛНОЦЕННЫЙ доступ).", , Ложь));

	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты,
		"execute_code",
		"Выполняет произвольный код BSL на сервере. По умолчанию работает в ПОЛНОЦЕННОМ режиме"
			+ " (доступ к файлам/COM/HTTP/внешним обработкам).Безопасный режим включается только"
			+ " явно (safe_mode=true) или глобальной настройкой execute_code_default_safe.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Функция ВыполнитьКод(Аргументы)

	Перем Результат;

	Код = ?(Аргументы.Свойство("code"), Аргументы.code, "");
	Если НЕ ЗначениеЗаполнено(Код) Тогда
		ВызватьИсключение "Параметр code обязателен";
	КонецЕсли;

	БезопасныйРежим = ОпределитьБезопасныйРежим(Аргументы);

	Если БезопасныйРежим Тогда
		ПроверитьОпасныеКонструкции(Код);
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;

	Попытка
		Выполнить(Код);
		ОтветМСР = Новый Структура;
		ОтветМСР.Вставить("status", "ok");
		ОтветМСР.Вставить("result", LN_МСРКодирование.БезопасноеЗначение(Результат));
		ОтветМСР.Вставить("safe_mode_used", БезопасныйРежим);
		Возврат ОтветМСР;
	Исключение
		ВызватьИсключение "Ошибка выполнения кода: " + ОписаниеОшибки();
	КонецПопытки;

КонецФункции

Функция ОпределитьБезопасныйРежим(Аргументы)

	Если Аргументы.Свойство("safe_mode") И Аргументы.safe_mode <> Неопределено Тогда
		Возврат Аргументы.safe_mode = Истина;
	КонецЕсли;
	// дефолт из регистра настроек
	Запрос = Новый Запрос("ВЫБРАТЬ Значение ИЗ РегистрСведений.LN_МСРНастройки ГДЕ Ключ = ""execute_code_default_safe""");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Значение = НРег(СокрЛП(Выборка.Значение));
		Возврат Значение = "true" Или Значение = "1" Или Значение = "истина";
	КонецЕсли;
	Возврат Ложь; // полноценный режим по умолчанию

КонецФункции

Процедура ПроверитьОпасныеКонструкции(Код)

	КодДляСканирования = НормализоватьКодДляСканирования(Код);

	ОпасныеСлова = "запись="
		+ "запись.,записьxml.,записьjson.,записьданных.,записьтекста.,записьzip.,"
		+ "файл,удалитьфайлы,переместитьфайл,скопироватьфайл,создатькаталог,"
		+ "соединение,httpсоединение,wsссылка,wsпрокси,fтpсоединение,почтовоесообщение,"
		+ "comобъект,внешняякомпонента,внешняяобработка,внешнийотчет,"
		+ "запуститьприложение,командаsystem,командадоса,"
		+ "запросомsql,подключитьвнешний,конструктор,"
		+ "выполнить(,вычислить(";

	Для Каждого СловоКлюч Из СтрРазделить(ОпасныеСлова, ",", Ложь) Цикл
		Слово = СокрЛП(СловоКлюч);
		Если ЗначениеЗаполнено(Слово) И СтрНайти(КодДляСканирования, Слово) > 0 Тогда
			ВызватьИсключение "Код содержит запрещённую в безопасном режиме конструкцию: " + Слово;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция НормализоватьКодДляСканирования(Код)

	Текст = НРег(Код);
	Буфер = "";
	ВСтроке = Ложь;
	Для Поз = 1 По СтрДлина(Текст) Цикл
		С = Сред(Текст, Поз, 1);
		Если С = """" Тогда
			ВСтроке = НЕ ВСтроке;
			Продолжить;
		КонецЕсли;
		Если НЕ ВСтроке Тогда
			Буфер = Буфер + С;
		КонецЕсли;
	КонецЦикла;
	Возврат СтрЗаменить(Буфер, " ", "");

КонецФункции

#КонецОбласти

#Область validate_query

Процедура ДобавитьValidateQuery(Инструменты)

	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"query", "string", "Текст запроса для валидации", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"fast", "boolean",
		"true — быстрая валидация через Запрос.НайтиПараметры() (без полного парсинга, только синтаксис уровня параметров)."
			+ " false (по умолчанию) — полный парсинг через СхемаЗапроса (медленнее, найдёт больше ошибок).",
		Ложь, Ложь));

	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты,
		"validate_query",
		"Проверяет синтаксис запроса 1С без его выполнения. Возвращает valid=true/false, packets_count (для full режима),"
			+ " parameters (массив имён найденных параметров для fast), описание ошибки.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

Функция ВалидироватьЗапрос(Аргументы)

	ТекстЗапроса = ?(Аргументы.Свойство("query"), Аргументы.query, "");
	Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ВызватьИсключение "Параметр query обязателен";
	КонецЕсли;
	БыстрыйРежим = ?(Аргументы.Свойство("fast"), Аргументы.fast = Истина, Ложь);

	Результат = Новый Структура;
	Результат.Вставить("mode", ?(БыстрыйРежим, "fast", "full"));

	Если БыстрыйРежим Тогда
		// Лёгкая валидация: только синтаксис достаточно глубокий, чтобы извлечь параметры.
		Попытка
			Запрос = Новый Запрос(ТекстЗапроса);
			ИменаПараметров = Запрос.НайтиПараметры();
			ИменаМассив = Новый Массив;
			Для Каждого Параметр Из ИменаПараметров Цикл
				ИменаМассив.Добавить(Параметр.Имя);
			КонецЦикла;
			Результат.Вставить("valid", Истина);
			Результат.Вставить("parameters", ИменаМассив);
			Возврат Результат;
		Исключение
			Результат.Вставить("valid", Ложь);
			Результат.Вставить("error", ОписаниеОшибки());
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;

	Попытка
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		Результат.Вставить("valid", Истина);
		Результат.Вставить("packets_count", СхемаЗапроса.ПакетЗапросов.Количество());
		Возврат Результат;
	Исключение
		Результат.Вставить("valid", Ложь);
		Результат.Вставить("error", ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;

КонецФункции

#КонецОбласти
//LN--
